{"config": {"layers": [{"config": {"filters": 16, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true, "trainable": true, "batch_input_shape": [null, 84, 84, 1], "strides": [1, 1], "data_format": "channels_last", "name": "conv2d", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "max_pooling2d", "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "dtype": "float32", "seed": null, "name": "dropout", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true, "filters": 32, "padding": "same", "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_1", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "noise_shape": null, "dtype": "float32", "seed": null, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true, "filters": 32, "padding": "same", "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_2", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "noise_shape": null, "dtype": "float32", "seed": null, "name": "dropout_2", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "trainable": true, "name": "flatten", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 256, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense", "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_3", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "noise_shape": null, "dtype": "float32", "seed": null, "name": "dropout_3", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 128, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_4", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 64, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_5", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 32, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_6", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 3, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "dtype": "float32", "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential"}, "backend": "tensorflow", "keras_version": "2.2.4-tf", "class_name": "Sequential"}